In [39]:
# Importing
import pandas as pd
import altair as alt
import numpy as np

from IPython.display import Markdown
from IPython.display import display
from tabulate import tabulate
import sqlite3

In [40]:
# Load Dataset
con = sqlite3.connect("lahmansbaseballdb.sqlite")

In [59]:
# SQL Query
sql = """
SELECT
    b.playerid AS Player_ID, b.yearid, sum(b.ab) AS At_Bat, sum(b.h) AS Hits, 
    CAST(SUM(b.h) AS FLOAT) / NULLIF(SUM(b.ab), 0) AS Batting_Average
FROM
    batting AS b
GROUP BY
    b.playerid,
    b.yearid
HAVING
    sum(b.ab) >= 1
ORDER BY 
5 DESC,
1 ASC
"""

df = pd.read_sql_query(sql, con)
print(df.shape)
df.head(5)

(84663, 5)

       Player_ID  yearID  At_Bat  Hits  Batting_Average
574    nymanny01    1974      14     9         0.642857
575    carsoma01    2013      11     7         0.636364
586    altizda01    1910      10     6         0.600000
640    silvech01    1948      14     8         0.571429
643    puccige01    1930      16     9         0.562500
...          ...     ...     ...   ...              ...
84620  zagunma01    2017      14     0         0.000000
84635  zeihehe01    1886      21     0         0.000000
84644  zimmebr01    2019      13     0         0.000000
84655   zitoba01    2011      13     0         0.000000
84659  zuberbi01    1941      26     0         0.000000

[68494 rows x 5 columns]

In [58]:
# 2
sql2 = """
SELECT
    b.playerid AS Player_ID, b.yearid, sum(b.ab) AS At_Bat, sum(b.h) AS Hits, 
    CAST(SUM(b.h) AS FLOAT) / NULLIF(SUM(b.ab), 0) AS Batting_Average
FROM
    batting AS b
GROUP BY
    b.playerid,
    b.yearid
HAVING
    sum(b.ab) >= 10
ORDER BY 
5 DESC,
1 ASC
"""

df2 = pd.read_sql_query(sql2, con)
print(df2.shape)
df2.head(5)

(68494, 5)

   Player_ID  yearID  At_Bat  Hits  Batting_Average
0  nymanny01    1974      14     9         0.642857
1  carsoma01    2013      11     7         0.636364
2  altizda01    1910      10     6         0.600000
3  silvech01    1948      14     8         0.571429
4  puccige01    1930      16     9         0.562500

In [60]:
sql3 = """
SELECT
    b.playerid AS Player_ID,
    SUM(b.ab) AS At_Bat,
    SUM(b.h) AS Hits,
    CAST(SUM(b.h) AS FLOAT) / NULLIF(SUM(b.ab), 0) AS Career_Batting_Average
FROM
    batting AS b
GROUP BY
    b.playerid
HAVING
    SUM(b.ab) >= 100
ORDER BY
    Career_Batting_Average DESC;
"""

df3 = pd.read_sql_query(sql3, con)
print(df3.shape)
df3.head(5)

(9056, 4)

   Player_ID  At_Bat  Hits  Career_Batting_Average
0   cobbty01   11436  4189                0.366299
1  barnero01    2391   860                0.359682
2  hornsro01    8173  2930                0.358497
3  jacksjo01    4981  1772                0.355752
4  meyerle01    1443   513                0.355509